import React from 'react';

function UserAgreement() {
  return (
    <div>
      ЗГОДА КОРИСТУВАЧА
      Умови використання сайту та додатку
      1.1. Дана згода користувача (іменоване надалі Згода) являє собою оферту умов щодо користування веб-сайтом http://frisor.ua/(далі – Сайт) і додатком для онлайн запису “Frisor” (далі – Додаток), Сайт та / або Додаток (далі – Ресурс), в особі Адміністрації Ресурсу і фізичною особою (в тому числі представниками юридичних осіб) (іменованим надалі Користувач), і регламентує умови надання Користувачем інформації для розміщення на Ресурсі.

      1.2. Користувачем Ресурсу вважається будь-яка фізична особа, коли-небудь здійснила доступ до Ресурсу, яка досягла віку, допустимого для акцепту цієї Згоди.

      1.3. Користувач зобов’язаний повністю ознайомитися з цією Згодою до моменту реєстрації на Ресурсі. Реєстрація Користувача на Ресурсі і подальше його використання, означає повне і беззастережне прийняття Користувачем цієї Згоди. У разі незгоди з умовами Згоди, використання Сайту і / або Додатку Користувачем повинно бути негайно припинено.

      1.4. Ця Згода може бути змінена та / або доповнено Адміністрацією Сайту в односторонньому порядку без будь-якого спеціального повідомлення. Ці Правила є відкритим і загальнодоступним документом.

      .5. Згода передбачає взаємні права та обов’язки Користувача і Адміністрації Ресурсу.

      Порядок використання Ресурсу
      2.1. Ресурс дозволяє Користувачеві переглядати і завантажувати інформацію з сайту виключно для особистого некомерційного використання. Забороняється змінювати матеріали Ресурсу, поширювати для громадських або комерційних цілей.

      2.2. При реєстрації на Ресурсі і оформленні замовлень або запису на послуги, Користувач погоджується надати достовірну і точну інформацію про себе і свої контактні дані.

      2.3. У процесі реєстрації на Ресурсі, Користувач отримує логін і пароль за безпеку, яких несе персональну відповідальність.

      2.4. Користувач може звертатися до Адміністрації Ресурсу з питаннями, претензіями, побажаннями щодо поліпшення роботи, або з будь-якої іншою інформацією. При цьому Користувач несе відповідальність, що дане звернення не є незаконним, загрозливим, порушує авторські права, дискримінацію людей по будь-якою ознакою, а також містить образи чи іншим чином порушує чинне законодавство України.

      Персональна інформація Користувача
      3.1. Адміністрація Ресурсу з повагою і відповідальністю ставиться до конфіденційної інформації будь-якої особи, що став відвідувачем цього Ресурсу.

      Беручи це Згода Користувач дає згоду на збір, обробку та використання певної інформації про Користувача відповідно до положень Закону України «Про захист персональних даних» та Правилах Адміністрації Ресурсу про захист персональних даних. Крім того, користувач дає згоду, що Адміністрація Ресурсу може збирати, використовувати, передавати, обробляти і підтримувати інформацію, пов’язану з членством Користувача з метою надання відповідних послуг.

      3.2. Адміністрація Ресурсу зобов’язується здійснювати збір тільки тієї персональної інформації, яку Споживач надає добровільно в разі, коли інформація потрібна для надання (поліпшення) послуг Споживачу.

      3.3. Адміністрація Ресурсу збирає як основні персональні дані, такі як ім’я, прізвище, по батькові, адреса, номер телефону та електронну адресу, так і вторинні (технічні) дані – файли cookies, інформація про з’єднання і системна інформація.

      3.4. Користувач погоджується з тим, що конфіденційність переданих через Інтернет даних не гарантована в разі, якщо доступ до цих даних отримано третіми особами поза зоною технічних засобів зв’язку, підвладних Адміністрації Ресурсу, Адміністрація Ресурсу не несе відповідальності за збитки, завдані таким доступом.

      3.5. Адміністрація Ресурсу може використовувати будь-яку зібрану через Ресурс інформацію з метою поліпшення змісту інтернет-сайту, Додатки і їх доопрацювання, передачі інформації Користувачеві (за запитами), для маркетингових або дослідницьких цілей, а також для інших цілей, що не суперечить положенням чинного законодавства України.

      На Ресурсі заборонені:
      4.1. Заклики до насильницької зміни чи повалення конституційного ладу або до захоплення державної влади; заклики до зміни адміністративних меж або державного кордону України, порушення порядку, встановленого Конституцією України; заклики до погромів, підпалів, знищення майна, захоплення будівель чи споруд, насильницького виселення громадян; заклики до агресії або до розв’язування воєнного конфлікту.

      4.2. Прямі та непрямі образи кого-небудь, зокрема політиків, чиновників, журналістів, користувачів ресурсу, в тому числі за національною, етнічною, расовою або релігійною приналежністю, а також шовіністичні висловлювання.

      4.3. Нецензурні висловлювання, висловлювання порнографічного, еротичного або сексуального характеру.

      4.4. Будь-яка образлива поведінка по відношенню до авторів статей і всіх учасників Ресурсу.

      4.5. Висловлювання, метою яких є навмисне провокування різкої реакції інших учасників Ресурсу.

      4.6. Реклама, комерційні повідомлення, а також повідомлення, які не мають інформаційного навантаження і не стосуються тематики Ресурсу, якщо на таку рекламу або ви не отримали листа спеціального дозволу від Адміністрації Ресурсу.

      4.7. Будь-які повідомлення та інші дії, які заборонені законодавством України.

      4.8. Видача себе за іншу людину або представника організації і / або співтовариства без достатніх на те прав, у тому числі за співробітників і власників Ресурсу, а також введення в оману щодо властивостей і характеристик будь-яких суб’єктів або об’єктів.

      4.9. Розміщення матеріалів, які Користувач не має права робити доступними згідно із законом або згідно яким-небудь контрактним відносинам, а також матеріалів, які порушують права на будь-який патент, торгову марку, комерційну таємницю, копірайт або інші права власності та / або авторські і суміжні з ним права третьої сторони.

      4.10. Розміщення не дозволеної спеціальним чином рекламної інформації, спаму, схем “пірамід”, “листів щастя”; матеріалів, що містять комп’ютерні коди, призначені для порушення, знищення або обмеження функціональності будь-якого комп’ютерного або телекомунікаційного устаткування або програм, для здійснення несанкціонованого доступу, а також серійні номери до комерційних програмних продуктів, логіни, паролі та

      інші засоби для отримання несанкціонованого доступу до платних ресурсів в Інтернет.

      4.11. Навмисне або випадкове порушення будь-яких застосовних місцевих, державних або міжнародних нормативно – правових актів.

      Обмеження відповідальності Адміністрації Ресурсу
      5.1. Адміністрація Ресурсу не несе ніякої відповідальності за будь-які помилки, друкарські помилки і неточності, які можуть бути виявлені в матеріалах, що містяться на даному Ресурсі. Адміністрація Ресурсу прикладає всі необхідні зусилля, щоб забезпечити точність і достовірність представленої на Ресурсі інформації.

      5.2. Інформація на Ресурсі постійно оновлюється і в будь-який момент може стати застарілою. Адміністрація Ресурсу не несе відповідальності за отримання застарілої інформації з Ресурсу, а також за нездатність Користувача отримати оновлення інформації що зберігається на Ресурсі.

      5.3. Адміністрація Ресурсу не несе ніякої відповідальності за висловлювання і думки відвідувачів сайту, залишені в якості коментарів або оглядів. Думка Адміністрації Ресурсу може не збігатися з думкою і позицією авторів оглядів і коментарів. У той же час Адміністрація Ресурсу вживає всіх можливих заходів, щоб не допускати публікацію повідомлень, які порушують чинне законодавство або норми моралі.

      5.4. Адміністрація Ресурсу не несе відповідальності за можливі протиправні дії Користувача відносно третіх осіб, або третіх осіб щодо Користувача.

      5.5. Адміністрація Ресурсу не несе відповідальності за висловлювання Користувача, вироблені або опубліковані на Ресурсі.

      5.6. Адміністрація Ресурсу не несе відповідальності за шкоду, збитки або витрати (реальні або можливі), що виникли в зв’язку з цим Ресурсом, його використанням або неможливістю використання.

      5.7. Адміністрація Ресурсу не несе відповідальності за втрату Користувачем можливості доступу до свого облікового запису – облікового запису на Ресурсі.

      5.8. Адміністрація Ресурсу не несе відповідальності за неповну, неточну, некоректну вказівку Користувачем своїх даних при створенні облікового запису Користувача.

      5.9. При виникненні проблем у використанні Ресурсу, незгоди з конкретними розділами Згоди, або отриманні Користувачем недостовірної інформації від третіх осіб, або інформації образливого характеру, будь-який інший неприйнятною інформації, будь ласка, зверніться до адміністрації Ресурсу для того, щоб Адміністрація Ресурсу могла проаналізувати і усунути відповідні дефекти, обмежити і запобігти надходженню

      на Ресурс небажаної інформації, а також, при необхідності, обмежити або припинити зобов’язання з надання своїх послуг будь-якому Користувачеві і клієнту, навмисне порушує приписи Згоди і функціонування роботи Ресурсу.

      5.10. З метою вищевикладеного Адміністрація Ресурсу залишає за собою право видаляти розміщену на Ресурсі інформацію і робити технічні і юридичні заходи для припинення доступу до Ресурсу користувачів, що створюють, згідно з висновком Адміністрації Ресурсу, проблеми у використанні Ресурсу іншими Користувачами, або користувачів, які порушують вимоги Згоди.

      Порядок дії Згоди
      6.1. Ця Згода є договором. Адміністрація Ресурсу залишає за собою право як змінити цю Згоду, так і ввести нове. Подібні зміни вступають в силу з моменту їх розміщення на Ресурсі. Використання Користувачем матеріалів Ресурсу після зміни Згоди автоматично означає їх прийняття.

      6.2. Дана Згода вступає в силу при першому відвідуванні Ресурсу Користувачем і діє між Користувачем і Компанією протягом усього періоду використання Користувачем Ресурсу.

      6.3. Ресурс є об’єктом права інтелектуальної власності Адміністрації Ресурсу. Всі виключні майнові авторські права на Ресурс належать Адміністрації Ресурсу. Використання Ресурсу Користувачами можливо тільки в рамках Згоди і законодавства України про права інтелектуальної власності.

      6.4. Всі торгові марки і назви, на які даються посилання в матеріалах справжнього Ресурсу, є власністю їх відповідних власників.

      6.5. Користувач погоджується не відтворювати, не повторювати, не копіювати, будь-які частини Ресурсу, крім тих випадків, коли такий дозвіл дано Користувачеві Адміністрацією Ресурсу.

      6.6. Ця Згода регулюється і тлумачиться відповідно до законодавства України. Питання, не врегульовані Згодою, підлягають вирішенню відповідно до законодавства України.

    </div>
  );
}

export default UserAgreement;
